<template>
  <div class="home">
    <TopNavbar activeIndex="/docs/privacypolicy"></TopNavbar>
    <el-row>
      <el-col :sm="24" :md="{span: 12, offset: 6}">
        <h1>隐私政策</h1>
        <p>
          <strong>版本生效日期：2021-07-05</strong>
        </p>
        <p>
          CCBC 11 （以及下文提到的“我们”、“我们的”或“本网站”）是由“北京密码菌文化传播有限公司”提供的网络产品。
        </p>
        <p>如果您决定使用我们产品提供的服务，本协议用于告知我们对于用户的隐私如何收集、使用和披露。</p>
        <p>
          <strong>如果您选择使用我们提供的服务，则表示您同意收集和使用与此政策相关的信息。我们收集的个人信息用于提供和改进服务。除非本隐私政策中另有说明，否则我们不会与任何人一起使用或分享您的信息。</strong>
        </p>
        <p>您在CCBC 11成功注册后，我们即开始收集您的信息。若您没有完成注册，则我们的信息收集不会开始，也不会在您的设备上存储Cookie一类的跟踪信息。</p>
        <p>除非本隐私政策另有规定，否则本隐私政策中使用的术语与我们的条款和条件具有相同的含义，可在CCBC 11中访问。</p>
        <h3>1. 收集信息</h3>
        <p>我们收集您提供给我们的部分信息，以及您使用网站和应用程序的数据。但我们将主要使用收集的数据为您提供满意的服务，并提高您的使用体验。</p>
        <p>以下类型的个人信息可能被收集、存储和使用：</p>
        <ul>
          <li>您计算机的基本信息，您的IP地址、浏览器版本号、时区、语言、时间戳、设备识别信息（如设备型号和名称、操作系统、屏幕大小、CPU信息等）、设备存储信息和移动设备的应用版本号。当您通过移动设备访问服务时，我们可能会自动收集有关移动设备类型、移动设备唯一的设备标识附等数据；</li>
          <li>有关您使用和访问网站或应用程序的信息，包括流量来源、访问时间、访问次数和路径；</li>
          <li>您在我们网站或应用程序上注册时填写的信息，例如您的电子邮件地址；</li>
          <li>您在我们网站上创建以及完善个人资料时填写的信息，例如您的姓名、手机号码、个人背景信息等；</li>
          <li>您在通过我们网站或应用程序进行线下交易时相关的信息，例如您的姓名、地址、电话号码等；</li>
          <li>您在使用网站时自动生成的信息，包括您的使用时间、频率、环境、操作步骤、搜索和提交的内容；</li>
          <li>您在使用网站时与其他用户的交互行为生成的信息，包括小组成员信息、邀请功能发送和接受的对象；</li>
          <li>您在使用网站时填写的信息，以及通过电子邮件与我们交流时所包含的信息。</li>
        </ul>
        <p>您仍需注意：在向我们披露其他人的个人信息之前，您必须根据本政策获得被披露方的许可，才能披露和使用被披露方的个人信息。</p>

        <h3>2. 如何使用收集的信息</h3>
        <p>CCBC 11 将收集的数据用于以下其中的部分或全部目的：</p>
        <ul>
          <li>组织CCBC 11的正常运营和服务</li>
          <li>提供维护服务</li>
          <li>检测，预防和解决技术问题</li>
          <li>提供分析或有价值的信息，以便我们改进服务</li>
        </ul>
        <p>请注意：CCBC 11收集到的部分或全部信息也会被我们用来提供反作弊服务。</p>

        <h3>3. 信息存储</h3>
        <h4>3.1. 数据安全</h4>
        <p>数据的安全性对我们很重要，我们将采取合理的技术和有组织的预防措施，以防止个人信息丢失、被滥用或被更改；</p>
        <p>您提供的所有个人信息都将存储在我们的受密码和防火墙保护的服务器上；</p>
        <p>您和我们网站的所有数据传输都将收到加密技术的保护；</p>
        <p>您必须了解并认同：没有任何安全措施是完美的或不可渗透的。虽然我们努力使用商业上可接受的方式来保护您的个人数据，但我们无法保证其绝对的安全性。</p>
        <p>为了保证网站和个人信息的安全使用，您有义务对用于访问我们网站的密码保密。除登录外，我们不会在其他渠道要求您提供密码。</p>
        <h4>3.2. 数据存储和传输</h4>
        <p>我们将收集的全部信息存储于中华人民共和国境内的服务器上。</p>
        <p>请注意：如果您位于中国境外并选择向我们提供信息，您的数据（包括个人数据）将会传输到中国并在中国处理，所使用的数据保护法律可能与您所在司法管辖区的数据保护法不同。</p>
        <p>如果您的个人信息发生数据跨境传输，我们会至少于7日前通过站内信或邮件的方式告知您数据出境的目的、接收方，并征得您的同意。确保接收方有足够的数据保护能力保护您的个人信息。</p>
        <h4>3.3. 数据披露</h4>
        <p>在必要的情况下，CCBC 11 可能会真诚地披露您的个人资料：</p>
        <ul>
          <li>履行法律义务</li>
          <li>保护和捍卫与CCBC 11相关的权利或财产</li>
          <li>防止或调查与服务相关的可能的不当行为</li>
          <li>保护服务或公众用户的人身安全</li>
          <li>防止法律责任</li>
        </ul>
        <h4>3.4. 服务供应商</h4>
        <p>我们可能使用第三方（公司或个人）来提升我们的服务（“服务提供商”）。第三方代表我们提供服务，执行相关服务或协助我们分析服务的使用方式。第三方只能代表我们访问您的个人数据以执行这些任务，并且有义务不将其用于任何其他目的。</p>
        <h4>3.5. 链接到其他网站</h4>
        <p>
          我们的服务可能包含指向非我们运营的其他网站的链接。如果您点击第三方链接，您将被引导至该第三方的网站。我们强烈建议您查看您访问的每个站点的隐私政策。
          <br>我们无法控制任何第三方网站或服务的内容，隐私政策或做法，也不承担任何责任。
        </p>
        <h3>4. 删除信息</h3>
        <p>我们将按照法律的规定在合理必要的期限内存储您的个人信息。</p>
        <p>在与上一条不抵触的前提下，通常您的个人数据会在账号停止活动后的5年后删除。但是我们可能仍然保留以下包含您个人数据的信息：（1）在法律要求的范围之内；（2）我们认为这些信息可能与正在进行的法律程序相关；（3）为了获得、行使或保护我们的合法权利，包括为防止欺诈和降低信用风险而向他人提供信息。</p>
        <p>当不再需要信息时，我们将使用合理的措施删除它，以保护信息不被未经授权的访问或使用。用户上传的内容如果涉嫌黄色、暴力不受欢迎内容我们将有权进行删除，用户也可向我们进行举报。</p>
        <h3>5. 保护信息</h3>
        <p>我们已经实施了合理的安全措施，以保障收集信息的机密性、安全性和完整性，并防止未经授权的访问和使用违反本隐私政策的信息。虽然我们采取合理的努力，以保障您的信息在我们维护时依然安全，但请注意，没有任何安全措施是绝对安全的。</p>
        <h3>6. 与未成年人有关的信息资料收集</h3>
        <p>我们非常重视对未成年人个人信息的保护。如果你是14周岁以下的未成年人，在使用我们的服务前，应确保事先取得监护人的同意，如果你是已满14不满18岁的未成年人，在使用我们服务前，应确保事先取得本人或监护人的同意。如果我们得知已收集了14周岁以下儿童的个人资料，我们会采取一切合理步骤，尽快删除有关资料。如果您知道您的孩子在未经您同意的情况下向我们提供了个人信息, 请与我们联系。</p>
        <h3>7. Cookie相关的技术说明</h3>
        <p>
          我们使用类似Cookie的跟踪技术来跟踪我们服务上的活动并保留某些信息。
          <br>像Cookie一样，我们会在您设备上存储包含少量数据的文件，包含匿名唯一标识符以及您的偏好和各种设置。
        </p>
        <p>我们在您浏览器的本地存储中存储了相关信息，如果您希望删除这些信息，以Chrome为例，您可在设置页面的“隐私设置和安全性”面板中，选择“Cookie和其他网站数据”，向下滚动并单击“查看所有Cookie和网站数据”，然后检索到本站域名，单击右边的“垃圾桶”按钮即可。</p>
        <p>删除这些数据后我们将暂时停止跟踪您，但您需要停止使用我们的网站。若您再次选择登录，我们将继续使用本地存储跟踪您。</p>

        <h3>8. 第三方服务条款</h3>
        <p>您可以使用第三方服务接入，此时您需要一并同意第三方服务商提供的隐私政策；</p>
        <p>在您授权我们读取您的第三方服务信息用于个人认证后，我们仅在您使用第三方接入服务验证信息时读取您存储在第三方服务中的个人信息，包括但不限于：</p>
        <ul>
          <li>您在第三方服务中的昵称、姓名等标识性名称；</li>
          <li>由第三方服务提供的您的唯一身份编码；</li>
          <li>您的头像、个人资料等信息；</li>
        </ul>
        <p>我们不会读取您存储在第三方服务中的敏感信息，包括：</p>
        <ul>
          <li>您的关注用户、好友列表；</li>
          <li>您的订单、文章、评论、短消息等内容；</li>
          <li>您在第三方服务中存储的任何与认证您的身份无关的个人信息；</li>
        </ul>
        <p>我们不会存储通过第三方服务读取到的您的信息，在使用完毕后将全部清除。下次使用时我们将向您重新发起读取第三方服务信息的授权。</p>
        <h3>9. 退出</h3>
        <p>根据本隐私政策，您可以从您的每台设备上卸载所有应用程序并停止使用本网站，从而永远自由地选择不参与将来在软件内收集您的个人信息。</p>
        <h3>10. 支持</h3>
        <p>如果您对本隐私政策有任何疑问，请通过邮件联系我们：</p>
        <p>info@cipherpuzzles.com</p>
        <h3>11. 对此隐私政策的更改</h3>
        <p>
          我们可能会不时更新我们的隐私政策。我们将通过在此页面上发布新的隐私政策来通知您任何更改。对于重大变更，我们也会向您发出电子邮件通知。
          <br>建议您定期查看本隐私政策以了解任何变更。本隐私政策的更改在此页面上发布时生效。
        </p>
      </el-col>
    </el-row>
  </div>
</template>

<script lang="ts">
import { Component, Prop, Vue } from "vue-property-decorator";
import TopNavbar from "@/components/TopNavbar.vue";

@Component({
  components: {
    TopNavbar
  }
})
export default class PrivacyPolicyView extends Vue {}
</script>