<template>
  <div class="home">
    <TopNavbar activeIndex="/docs/userterms"></TopNavbar>
    <el-row>
      <el-col :sm="24" :md="{span: 12, offset: 6}">
        <h1>用户协议</h1>
        <p>
          <strong>当前版本发布日期：2020-05-29</strong>
        </p>
        <br />
        <p>欢迎您注册CCBC X。请阅读以下重要内容。</p>
        <p>注册为CCBC X的用户即视为您已接受本协议。若您对本协议有异议，请停止注册CCBC X。</p>
        <h3>一、协议的接受、变更与补充</h3>
        <p>1. 在注册界面点击注册，即视为您已自愿接受本协议。</p>
        <p>2. CCBC X有权利对本协议进行修改，协议修改后，将在本页面发布修改后的内容。修改后的协议将立即替代原协议；如果您继续使用本站，则视为您接受本协议的修改。</p>
        <p>3. 本协议可能未能覆盖完全您与我们之间的所有权利和义务。因此，在有必要时我们将公布补充协议。公布补充协议时将使用网站公告系统发布。一经发布，即视为本协议的补充协议。</p>
        <h3>二、用户账号</h3>
        <p>1. 您一经注册成功，即取得您的注册账号，成为本站注册用户。您需要对您提交的所有注册信息的真实性、合法性、有效性承担全部责任。您可自行创建、修改昵称，但用户名和昵称的命名及使用应遵守相关法律法规并符合网络道德，不得冒充他人或恶意注册使人误认；不得利用他人的名义发布任何信息；不得恶意使用注册帐号导致其他用户误认；用户名、昵称和个人简介中不能含有任何侮辱、诽谤、淫秽或暴力等侵害他人合法权益或违反公序良俗的词语。如您违反前述规定，我们有权随时限制或拒绝您使用该账号，甚至注销该账号。</p>
        <p>2. 您在本站只能拥有一个账号，且只能由您一个人使用。若您通过重复注册等行为取得多个账号并同时使用，我们有权随时拒绝您使用账号并有权注销您的所有账号；若您将账号借用他人使用，本站有权拒绝该账号的使用并有权注销该账号。</p>
        <p>3. 您应当妥善保管好您注册时填写的用户名和密码，不要将账号和密码告知他人。因非本站原因导致的账号泄露造成的法律后果和责任由您全部承担。</p>
        <p>4. 您应当对此账号在本站进行的所有活动和事件承担全部后果与法律责任。</p>
        <p>5. 若您账号或密码不慎遗失，请立即联系我们。按照您注册信息身份核实后由我们为您重置密码。若您发现账号遭到未授权的使用或其他安全问题的情况，请您立即告知我们。</p>
        <h3>三、用户个人信息</h3>
        <h4>1. 个人信息的保护</h4>
        <p>
          1.1. 我们会尽全力保护您的个人信息及隐私。
          <br />1.2. 您在注册帐号以及使用本站服务的过程中，需要填写必要的信息。若您的信息填写不完整，可能无法成功注册账号，或在使用本站服务中受到限制。
          <br />1.3. 我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或其他的个人信息。但是我们无法保证您可以修改全部的信息。
          <br />1.4. 我们将运用各种技术来保护您的个人信息，以免遭受泄露
          <br />1.5. 未经您的同意，我们不会向任何其他的公司、组织或个人披露您的个人信息，但法律另有规定的除外。
          <br />1.6. 我们重视未成年人个人信息的保护。如果您是未成年人希望使用本站的服务，请确保得到监护人的同意。
        </p>
        <h4>2. 个人信息的收集</h4>
        <p>因为您提供更好服务的需要，在您使用账号的过程中，我们会收集一些您的信息。</p>
        <p>2.1. 由您提供的信息：您在使用本站服务时向我们提供的必要个人信息，包括但不限于您的姓名、电子邮箱、地址、电话号码等。</p>
        <p>
          2.2. 收集的信息：您在使用本站服务时，我们可能会通过Web浏览器或移动应用（App）自动收集与您相关的信息，包括：
          <br />(1) 设备信息。包括但不限于您的IP地址、浏览器版本号、时区、语言、时间戳、设备识别信息（如设备型号和名称、操作系统、屏幕大小、CPU信息等）、设备存储信息和移动设备的应用版本号。
          <br />(2) 在使用本服务时产生的记录。包括但不限于您的登录记录、提交记录以及浏览页面的记录。
        </p>
        <p>2.3. 信息的使用</p>
        <p>我们获取的您的信息可能用作下列用途：</p>
        <ul>
          <li>向您提供服务；</li>
          <li>提供维护、检测等技术服务；</li>
          <li>用于改善我们现有服务。</li>
        </ul>
        <h4>3. 隐私政策</h4>
        <p>
          我们非常重视您的个人信息保护，依据最新的监管要求制定并更新了《<router-link to="/docs/privacypolicy">隐私政策</router-link>》。
        </p>
        <p>该政策将帮助您了解以下内容：</p>
        <ul>
          <li>我们如何收集和使用您的个人信息</li>
          <li>我们如何使用Cookie这样的追踪技术</li>
          <li>您的个人信息如何存储以及在全球范围转移</li>
          <li>我们如何共享、转让、公开披露您的个人信息</li>
          <li>我们如何保护您的个人信息</li>
          <li>您的权利</li>
          <li>未成年人条款</li>
          <li>本隐私政策时效及如何更新</li>
          <li>如何联系我们</li>
          <li>其他</li>
        </ul>
        <h3>四、本站提供的服务</h3>
        <p>1. 本站为用户提供CCBC X比赛的报名、在线比赛和自动判题的服务。本站有权对提供的服务范围进行增减或调整。</p>
        <p>2. CCBC X比赛的规则、赛制、裁判，以及在比赛中由赛事承办方提供内容等不由本协议规定。由CCBC X组委会另行确定和公告。</p>
        <p>3. 您在使用本站服务过程中，不得以任何方式直接或间接从事违反法律及社会公德的行为；应当尊重不同地区的道德和风俗习惯，避免因使用本服务而使本站卷入公共事件。</p>
        <p>4. 我们有权对您使用本站服务的情况进行审查和监督。若您使用本服务时违反任何规定，我们有权要求用户改正或采取必要措施（包括但不限于限制账号使用或注销账号）来减轻用户不当行为造成的影响。</p>
        <p>5. 您理解并同意，我们的服务是按照现有技术和条件所能达到的现状提供的。我们会尽最大努力向您提供服务，确保服务的连贯性和安全性；但无法随时预见和防范法律、技术及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务不稳定或是政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。</p>
        <p>6. 您应当理解，您使用本站提供的服务需自行准备相关终端设备，如电脑、调制解调器等设备，以及自行承担所需的费用（如话费、上网费等）。您理解并同意，使用本服务将耗用您的终端设备以及带宽资源。</p>
        <h3>五、知识产权声明</h3>
        <p>1. 您通过在线比赛系统向我们提交的文件，以及在站内发表的文章等您的原创内容，除另有约定外，著作权归用户本人所有。</p>
        <p>2. 对于您通过在线比赛系统向我们提交的文件，以及在站内发表的文章等您的原创内容，您同意授予CCBC X这些作品在全球范围内的永久免费、不可撤销、非独家的使用许可。包括但不限于：复制权、改编权、发行权、展览权、信息网络传播权、汇编权等各项权利。我们有权自行将这些内容转载分发、用于本站的平台展示、推广等，或其他法律未禁止的方式使用这些内容。</p>
        <p>3. 由本站，以及CCBC X组委会创作并由本站向您提供的全部产品、技术、程序、标识、版面设计、文本、图片、动画、音频、视频等知识产权均归本站所有。您在本站的任何行为均不视为本站向您做出了任何授权。未经本站相关权利人书面同意，任何人不得将上述内容在任何平台直接或间接发布、使用、改写或再发行，或被用于任何其他商业目的。您可合理使用本站内容，但必须符合以下条件：</p>
        <ul>
          <li>您不得基于商业目的使用本站提供的内容；</li>
          <li>您不得对外宣称您对本站任何内容享有任何知识产权；</li>
          <li>当您的合理使用行为涉及到任何其他主体，您在使用时必须明确告知。</li>
        </ul>
        <p>4. 对于您通过在线比赛系统向我们提交的文件，以及在站内发表的文章等内容，您应保证您系著作权人或已取得合法授权。并且该内容不会侵犯其他第三方的合法权益。如果第三方提出关于著作权的异议，本站有权向您核实并独立判断，并有权采取技术手段删除或屏蔽这些内容，您应当配合。给本站或者任何第三方造成损失的，您应负全部法律责任。</p>
        <p>5. 您同意授权本站或其指定的代理人代表本站或您对任何侵犯了您的权利的第三方发出通知、警告、投诉、发起行政执法、诉讼程序，或谈判和解，并且您同意在本站任何必要的情况下参与共同维权。</p>
        <p>6. 本站有权但无义务对您发布的内容进行审核。</p>
        <h3>六、有关违法行为的约定</h3>
        <p>
          1. 您在使用本服务时须遵守法律法规，不得利用本服务从事违法违规行为，包括但不限于：
          <br />(1) 反对宪法所确定的基本原则的；
          <br />(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
          <br />(3) 损害国家荣誉和利益的；
          <br />(4) 煽动民族仇恨、民族歧视，破坏民族团结的；
          <br />(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；
          <br />(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；
          <br />(7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
          <br />(8) 侮辱或者诽谤他人，侵害他人合法权益的；
          <br />(9) 含有法律、行政法规禁止的其他内容的信息。
        </p>
        <p>2. 如果您违反了本条约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求本站给予协助。造成本站或第三方损害的，您应依法予以赔偿，本站不承担任何责任。</p>
        <p>3. 如果本站发现或收到他人举报您发布的信息违反本条约定，本站有权进行独立判断并采取技术手段予以删除、屏蔽或断开链接。同时，本站有权视用户的行为性质，采取包括但不限于暂停或终止服务，限制或注销账号，追究法律责任等措施。</p>
        <p>4. 您违反本条约定，导致任何第三方损害的，您应当独立承担责任；本站因此遭受损失的，您也应当一并赔偿。</p>
        <p>5. 违反本条约定，视为您的严重违约，本站可以中止对您的服务，解除双方间的服务协议和法律关系，且无需退还您所支付的费用（如有），视为您支付本站的违约金，如不足以弥补本站的损失的，本站还可通过其他法律途径向您追索。</p>
        <h3>七、不可抗力与免责</h3>
        <p>1. 您理解并同意，在使用本站服务的过程中，可能会遇到不可抗力等风险因素，使本站提供的服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等，以及社会事件如战争、动乱、政府行为等。出现上述情况时，本站将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失，本站在法律允许的范围内免责。</p>
        <p>
          2. 在法律允许的范围内，本站对以下情形导致的服务中断或受阻不承担责任：
          <br />(1) 受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；
          <br />(2) 用户或本站的电脑软件、系统、硬件和通信线路出现故障；
          <br />(3) 用户操作不当；
          <br />(4) 用户通过非本站授权的方式使用本站服务；
          <br />(5) 其他本站无法控制或合理预见的情形。
        </p>
        <p>
          3. 您理解并同意，在使用本站服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，本站不对非本站发布的任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：
          <br />(1) 来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；
          <br />(2) 因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；
          <br />(3) 其他因网络信息或用户行为引起的风险。
        </p>
        <p>4. 您理解并同意，本站提供的服务并非为某些特定目的（包括但不限于核设施、军事用途、医疗设施、交通通讯等重要领域）而设计，如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，本站不承担法律责任。</p>
        <p>5. 本站依据本协议约定获得处理违法违规内容的权利，该权利不构成本站的义务或承诺，本站不能保证及时发现违法行为或进行相应处理。</p>
        <p>6. 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意有关部门发布的有关防范诈骗犯罪的提示。</p>
        <p>7. 用户在本站发表的内容仅表明其个人的立场和观点，并不代表本站的立场或观点。作为内容的发表者，用户需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任</p>
        <h3>八、协议的生效与修改</h3>
        <p>1. 您在本站注册账号并使用本站的服务即视为您已阅读本协议并接受本协议的约束。</p>
        <p>2. 本站有权在必要时修改本协议条款，您可以在相关服务页面查阅最新版本的协议条款。</p>
        <p>3. 本协议条款变更后，如果您继续使用本站提供的服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当退出本站并停止使用本站提供的服务。</p>
        <h3>九、 服务的中止与终止</h3>
        <p>1. 本站可能会对提供的服务内容进行不定时的变更，也可能会中断、中止或终止服务。</p>
        <p>
          2. 如发生下列任何一种情形，本站有权不经通知而中断或终止向您提供的服务：
          <br />(1) 根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；
          <br />(2) 您涉嫌违反相关法律法规规定；
          <br />(3) 按照法律规定或主管部门的要求；
          <br />(4) 出于安全的原因或其他必要的情形；
          <br />(5) 本协议中明确约定的其他情形。
        </p>
        <h3>十、 法律适用与争议解决</h3>
        <p>1. 本协议签订地为中华人民共和国上海市浦东新区。</p>
        <p>2. 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（仅为本合同之目的，不包括香港、台湾、澳门地区）。</p>
        <p>3. 若您和本站之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地人民法院管辖。</p>
        <p>4. 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
        <p>5. 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>
        <h3>十一、 未成年人使用</h3>
        <p>1. 若用户未满18周岁，则为未成年人，应在监护人监护、指导下阅读本协议和使用本站服务。</p>
        <p>
          2. 未成年人用户涉世未深，容易被网络虚象迷惑，且好奇心强，遇事缺乏随机应变的处理能力，很容易被别有用心的人利用而又缺乏自我保护能力。因此，未成年人用户在使用本服务时应注意以下事项，提高安全意识，加强自我保护：
          <br />(1) 认清网络世界与现实世界的区别，避免沉迷于网络，影响日常的学习生活；
          <br />(2) 填写个人资料时，加强个人保护意识，以免不良分子对个人生活造成骚扰；
          <br />(3) 在监护人或老师的指导下，学习正确使用网络；
          <br />(4) 避免陌生网友随意会面或参与联谊活动，以免不法分子有机可乘，危及自身安全；
        </p>
        <h3>十二、 其他</h3>
        <p>1. 如有未尽事宜，本站将根据其他需要制订其他补充协议。</p>
      </el-col>
    </el-row>
  </div>
</template>

<script lang="ts">
import { Component, Prop, Vue } from "vue-property-decorator";
import TopNavbar from "@/components/TopNavbar.vue";

@Component({
  components: {
    TopNavbar
  }
})
export default class UserTermsView extends Vue {}
</script>