<template>
  <div class="home">
    <TopNavbar activeIndex="/"/>
    <div>
      <h1>主页</h1>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
      <p>测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。测试文本，一些测试文本，测试。</p>
    </div>
  </div>
</template>

<script lang="ts">
// @ is an alias to /src
import { Component, Prop, Vue } from 'vue-property-decorator';
import TopNavbar from '@/components/TopNavbar.vue'

@Component({
    components: {
        TopNavbar
    }
})
export default class HomeView extends Vue {

}
</script>